
/*
        Банки_Елемент.cs
        Елемент
*/

using Gtk;
using InterfaceGtk3;

using GeneratedCode.Довідники;
using GeneratedCode.Документи;
using GeneratedCode.Перелічення;

namespace StorageAndTrade
{
    class Банки_Елемент : ДовідникЕлемент
    {
        public Банки_Objest Елемент { get; set; } = new Банки_Objest();

        #region Fields
        Entry Код = new Entry() { WidthRequest = 100 };
        Entry Назва = new Entry() { WidthRequest = 500 };
        Entry ПовнаНазва = new Entry() { WidthRequest = 500 };
        Entry НазваГоловноїУстановиАнг = new Entry() { WidthRequest = 500 };
        Entry ТипНаселеногоПункту = new Entry() { WidthRequest = 100 };
        Entry КодМФО = new Entry() { WidthRequest = 100 };
        Entry КодЄДРПОУ = new Entry() { WidthRequest = 100 };
        Entry УнікальнийКодБанку = new Entry() { WidthRequest = 100 };
        Entry КодОбластіОпераційноїДіяльності = new Entry() { WidthRequest = 100 };
        Entry НазваОбластіОпераційноїДіяльності = new Entry() { WidthRequest = 100 };
        Entry КодОбластіЗгідноСтатуту = new Entry() { WidthRequest = 100 };
        Entry НазваОбластіЗгідноСтатуту = new Entry() { WidthRequest = 100 };
        Entry ПоштовийІндекс = new Entry() { WidthRequest = 100 };
        Entry НазваНаселеногоПункту = new Entry() { WidthRequest = 100 };
        Entry Адреса = new Entry() { WidthRequest = 300 };
        Entry КодТелефонногоЗвязку = new Entry() { WidthRequest = 100 };
        Entry НомерТелефону = new Entry() { WidthRequest = 100 };
        Entry ЧисловийКодСтануУстанови = new Entry() { WidthRequest = 100 };
        Entry НазваСтануУстанови = new Entry() { WidthRequest = 300 };
        Entry ДатаЗміниСтану = new Entry() { WidthRequest = 100 };
        Entry ДатаВідкриттяУстанови = new Entry() { WidthRequest = 100 };
        Entry ДатаЗакриттяУстанови = new Entry() { WidthRequest = 100 };
        Entry КодНБУ = new Entry() { WidthRequest = 100 };
        Entry НомерЛіцензії = new Entry() { WidthRequest = 100 };
        Entry ДатаЛіцензії = new Entry() { WidthRequest = 100 };
        Entry КодСтатусу = new Entry() { WidthRequest = 100 };
        Entry Статус = new Entry() { WidthRequest = 300 };
        Entry ДатаЗапису = new Entry() { WidthRequest = 100 };

        #endregion

        #region TabularParts

        #endregion

        public Банки_Елемент() : base()
        {
            Елемент.UnigueIDChanged += UnigueIDChanged;
            Елемент.CaptionChanged += CaptionChanged;
        }

        protected override void CreatePack1(Box vBox)
        {

            // Код
            CreateField(vBox, "Код:", Код);

            // Назва
            CreateField(vBox, "Назва:", Назва);

            // ПовнаНазва
            CreateField(vBox, "Повна назва:", ПовнаНазва);

            // НазваГоловноїУстановиАнг
            CreateField(vBox, "Назва головної установи Анг:", НазваГоловноїУстановиАнг);

            // ТипНаселеногоПункту
            CreateField(vBox, "Тип населеного пункту:", ТипНаселеногоПункту);

            // КодМФО
            CreateField(vBox, "Код МФО:", КодМФО);

            // КодЄДРПОУ
            CreateField(vBox, "Код ЄДРПОУ:", КодЄДРПОУ);

            // УнікальнийКодБанку
            CreateField(vBox, "Унікальний код:", УнікальнийКодБанку);

            // КодОбластіОпераційноїДіяльності
            CreateField(vBox, "Код області операційної діяльності:", КодОбластіОпераційноїДіяльності);

            // НазваОбластіОпераційноїДіяльності
            CreateField(vBox, "Назва області операційної діяльності:", НазваОбластіОпераційноїДіяльності);

            // КодОбластіЗгідноСтатуту
            CreateField(vBox, "Код області згідно статуту:", КодОбластіЗгідноСтатуту);

            // НазваОбластіЗгідноСтатуту
            CreateField(vBox, "Назва області згідно статуту:", НазваОбластіЗгідноСтатуту);

            // ПоштовийІндекс
            CreateField(vBox, "Поштовий індекс:", ПоштовийІндекс);

            // НазваНаселеногоПункту
            CreateField(vBox, "Назва населеного пункту:", НазваНаселеногоПункту);

            // Адреса
            CreateField(vBox, "Адреса:", Адреса);

            // КодТелефонногоЗвязку
            CreateField(vBox, "Код телефонного зв'язку:", КодТелефонногоЗвязку);

            // НомерТелефону
            CreateField(vBox, "Номер телефону:", НомерТелефону);

            // ЧисловийКодСтануУстанови
            CreateField(vBox, "Числовий код стану установи:", ЧисловийКодСтануУстанови);

            // НазваСтануУстанови
            CreateField(vBox, "Назва стану установи:", НазваСтануУстанови);

            // ДатаЗміниСтану
            CreateField(vBox, "Дата зміни стану:", ДатаЗміниСтану);

            // ДатаВідкриттяУстанови
            CreateField(vBox, "Дата відкриття установи:", ДатаВідкриттяУстанови);

            // ДатаЗакриттяУстанови
            CreateField(vBox, "Дата закриття установи:", ДатаЗакриттяУстанови);

            // КодНБУ
            CreateField(vBox, "Код НБУ:", КодНБУ);

            // НомерЛіцензії
            CreateField(vBox, "Номер ліцензії:", НомерЛіцензії);

            // ДатаЛіцензії
            CreateField(vBox, "Дата ліцензії:", ДатаЛіцензії);

            // КодСтатусу
            CreateField(vBox, "Код статусу:", КодСтатусу);

            // Статус
            CreateField(vBox, "Статус:", Статус);

            // ДатаЗапису
            CreateField(vBox, "Дата запису:", ДатаЗапису);
        }

        protected override void CreatePack2(Box vBox)
        {

        }

        #region Присвоєння / зчитування значень

        public override void SetValue()
        {
            Код.Text = Елемент.Код;
            Назва.Text = Елемент.Назва;
            ПовнаНазва.Text = Елемент.ПовнаНазва;
            НазваГоловноїУстановиАнг.Text = Елемент.НазваГоловноїУстановиАнг;
            ТипНаселеногоПункту.Text = Елемент.ТипНаселеногоПункту;
            КодМФО.Text = Елемент.КодМФО;
            КодЄДРПОУ.Text = Елемент.КодЄДРПОУ;
            УнікальнийКодБанку.Text = Елемент.УнікальнийКодБанку;
            КодОбластіОпераційноїДіяльності.Text = Елемент.КодОбластіОпераційноїДіяльності;
            НазваОбластіОпераційноїДіяльності.Text = Елемент.НазваОбластіОпераційноїДіяльності;
            КодОбластіЗгідноСтатуту.Text = Елемент.КодОбластіЗгідноСтатуту;
            НазваОбластіЗгідноСтатуту.Text = Елемент.НазваОбластіЗгідноСтатуту;
            ПоштовийІндекс.Text = Елемент.ПоштовийІндекс;
            НазваНаселеногоПункту.Text = Елемент.НазваНаселеногоПункту;
            Адреса.Text = Елемент.Адреса;
            КодТелефонногоЗвязку.Text = Елемент.КодТелефонногоЗвязку;
            НомерТелефону.Text = Елемент.НомерТелефону;
            ЧисловийКодСтануУстанови.Text = Елемент.ЧисловийКодСтануУстанови;
            НазваСтануУстанови.Text = Елемент.НазваСтануУстанови;
            ДатаЗміниСтану.Text = Елемент.ДатаЗміниСтану;
            ДатаВідкриттяУстанови.Text = Елемент.ДатаВідкриттяУстанови;
            ДатаЗакриттяУстанови.Text = Елемент.ДатаЗакриттяУстанови;
            КодНБУ.Text = Елемент.КодНБУ;
            НомерЛіцензії.Text = Елемент.НомерЛіцензії;
            ДатаЛіцензії.Text = Елемент.ДатаЛіцензії;
            КодСтатусу.Text = Елемент.КодСтатусу;
            Статус.Text = Елемент.Статус;
            ДатаЗапису.Text = Елемент.ДатаЗапису;
        }

        protected override void GetValue()
        {
            Елемент.Код = Код.Text;
            Елемент.Назва = Назва.Text;
            Елемент.ПовнаНазва = ПовнаНазва.Text;
            Елемент.НазваГоловноїУстановиАнг = НазваГоловноїУстановиАнг.Text;
            Елемент.ТипНаселеногоПункту = ТипНаселеногоПункту.Text;
            Елемент.КодМФО = КодМФО.Text;
            Елемент.КодЄДРПОУ = КодЄДРПОУ.Text;
            Елемент.УнікальнийКодБанку = УнікальнийКодБанку.Text;
            Елемент.КодОбластіОпераційноїДіяльності = КодОбластіОпераційноїДіяльності.Text;
            Елемент.НазваОбластіОпераційноїДіяльності = НазваОбластіОпераційноїДіяльності.Text;
            Елемент.КодОбластіЗгідноСтатуту = КодОбластіЗгідноСтатуту.Text;
            Елемент.НазваОбластіЗгідноСтатуту = НазваОбластіЗгідноСтатуту.Text;
            Елемент.ПоштовийІндекс = ПоштовийІндекс.Text;
            Елемент.НазваНаселеногоПункту = НазваНаселеногоПункту.Text;
            Елемент.Адреса = Адреса.Text;
            Елемент.КодТелефонногоЗвязку = КодТелефонногоЗвязку.Text;
            Елемент.НомерТелефону = НомерТелефону.Text;
            Елемент.ЧисловийКодСтануУстанови = ЧисловийКодСтануУстанови.Text;
            Елемент.НазваСтануУстанови = НазваСтануУстанови.Text;
            Елемент.ДатаЗміниСтану = ДатаЗміниСтану.Text;
            Елемент.ДатаВідкриттяУстанови = ДатаВідкриттяУстанови.Text;
            Елемент.ДатаЗакриттяУстанови = ДатаЗакриттяУстанови.Text;
            Елемент.КодНБУ = КодНБУ.Text;
            Елемент.НомерЛіцензії = НомерЛіцензії.Text;
            Елемент.ДатаЛіцензії = ДатаЛіцензії.Text;
            Елемент.КодСтатусу = КодСтатусу.Text;
            Елемент.Статус = Статус.Text;
            Елемент.ДатаЗапису = ДатаЗапису.Text;
        }

        #endregion

        protected override async ValueTask<bool> Save()
        {
            bool isSaved = false;
            try
            {
                if (await Елемент.Save())
                {
                    isSaved = true;
                }
            }
            catch (Exception ex)
            {
                ФункціїДляПовідомлень.ДодатиПовідомлення(Елемент.GetBasis(), Caption, ex);
            }
            return isSaved;
        }
    }
}
