
/*
        ПартіїТоварів_Підсумки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Константи;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ПартіїТоварів_Підсумки_Звіт
    {
        public static async ValueTask Сформувати()
        {

            string query = $@"
SELECT
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.Організація} AS Організація,
            Довідники_Організації.{Організації_Const.Назва} AS Організація_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.ПартіяТоварівКомпозит} AS ПартіяТоварівКомпозит,
            Довідники_ПартіяТоварівКомпозит.{ПартіяТоварівКомпозит_Const.Назва} AS ПартіяТоварівКомпозит_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.Склад} AS Склад,
            Довідники_Склади.{Склади_Const.Назва} AS Склад_Назва,
    Підсумки.{ПартіїТоварів_Підсумки_TablePart.Кількість} AS Кількість
FROM
    {ПартіїТоварів_Підсумки_TablePart.TABLE} AS Підсумки
    LEFT JOIN {Організації_Const.TABLE} AS Довідники_Організації ON Довідники_Організації.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.Організація}
    
    LEFT JOIN {ПартіяТоварівКомпозит_Const.TABLE} AS Довідники_ПартіяТоварівКомпозит ON Довідники_ПартіяТоварівКомпозит.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.ПартіяТоварівКомпозит}
    
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.Серія}
    
    LEFT JOIN {Склади_Const.TABLE} AS Довідники_Склади ON Довідники_Склади.uid = 
        Підсумки.{ПартіїТоварів_Підсумки_TablePart.Склад}
    
";
            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ПартіїТоварів_Підсумки_Звіт",
                Caption = "Підсумки",
                Query = query
            };

            Звіт.ColumnSettings.Add("Організація_Назва", new("Організація", "Організація", Організації_Const.POINTER));
            Звіт.ColumnSettings.Add("ПартіяТоварівКомпозит_Назва", new("Партія", "ПартіяТоварівКомпозит", ПартіяТоварівКомпозит_Const.POINTER));
            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));

            if (Системні.ВестиОблікПоХарактеристикахНоменклатури_Const)
                Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));

            if (Системні.ВестиОблікПоСеріяхНоменклатури_Const)
                Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));

            Звіт.ColumnSettings.Add("Склад_Назва", new("Склад", "Склад", Склади_Const.POINTER));
            Звіт.ColumnSettings.Add("Кількість", new("Кількість", "", "", 1, ЗвітСторінка.ФункціяДляКолонкиБазоваДляЧисла));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}
