
/*
        ВільніЗалишки_Підсумки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Константи;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ВільніЗалишки_Підсумки_Звіт
    {
        public static async ValueTask Сформувати()
        {

            string query = $@"
SELECT
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.Склад} AS Склад,
            Довідники_Склади.{Склади_Const.Назва} AS Склад_Назва,
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.ВНаявності} AS ВНаявності,
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.ВРезервіЗіСкладу} AS ВРезервіЗіСкладу,
    Підсумки.{ВільніЗалишки_Підсумки_TablePart.ВРезервіПідЗамовлення} AS ВРезервіПідЗамовлення
FROM
    {ВільніЗалишки_Підсумки_TablePart.TABLE} AS Підсумки
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Підсумки.{ВільніЗалишки_Підсумки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Підсумки.{ВільніЗалишки_Підсумки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {Склади_Const.TABLE} AS Довідники_Склади ON Довідники_Склади.uid = 
        Підсумки.{ВільніЗалишки_Підсумки_TablePart.Склад}
";
            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ВільніЗалишки_Підсумки_Звіт",
                Caption = "Підсумки",
                Query = query
            };

            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Склад_Назва", new("Склад", "Склад", Склади_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявності", new("В наявності", "", "", 1));
            Звіт.ColumnSettings.Add("ВРезервіЗіСкладу", new("В резерві зі складу", "", "", 1));
            Звіт.ColumnSettings.Add("ВРезервіПідЗамовлення", new("В резерві під замовлення", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}
