using Gtk;
using InterfaceGtk;

using AccountingSoftware;
using StorageAndTrade_1_0;
using StorageAndTrade_1_0.Константи;

namespace StorageAndTrade
{
    class ФункціїНалаштуванняКористувача
    {
        public static async ValueTask<string> ОтриматиПеріодДляЖурналу(string НазваЖурналу)
        {
            Системні.НалаштуванняКористувача_ПеріодиЖурналів_TablePart НалаштуванняКористувача = new();

            ЗаповнитиВідбір(НалаштуванняКористувача, НазваЖурналу);

            //Вибирати тільки одне значення
            НалаштуванняКористувача.QuerySelect.Limit = 1;

            await НалаштуванняКористувача.Read();
            return (НалаштуванняКористувача.Records.Count != 0) ? НалаштуванняКористувача.Records[0].ПеріодЗначення : "";
        }

        static void ЗаповнитиВідбір(Системні.НалаштуванняКористувача_ПеріодиЖурналів_TablePart НалаштуванняКористувача, string НазваЖурналу)
        {
            //Відбір по користувачу
            НалаштуванняКористувача.QuerySelect.Where.Add(new Where(Системні.НалаштуванняКористувача_ПеріодиЖурналів_TablePart.Користувач, Comparison.EQ, Program.Користувач.UnigueID.UGuid));

            //Відбір по журналу
            НалаштуванняКористувача.QuerySelect.Where.Add(new Where(Comparison.AND, Системні.НалаштуванняКористувача_ПеріодиЖурналів_TablePart.Журнал, Comparison.EQ, НазваЖурналу));
        }

        public static async ValueTask ЗаписатиПеріодДляЖурналу(string НазваЖурналу, string Період)
        {
            Системні.НалаштуванняКористувача_ПеріодиЖурналів_TablePart НалаштуванняКористувача = new();

            //Очистка
            {
                ЗаповнитиВідбір(НалаштуванняКористувача, НазваЖурналу);

                await НалаштуванняКористувача.Read();
                await НалаштуванняКористувача.RemoveAll(НалаштуванняКористувача.Records);
            }

            //Додавання нового
            {
                НалаштуванняКористувача.Records.Add(new()
                {
                    Користувач = Program.Користувач,
                    Журнал = НазваЖурналу,
                    ПеріодЗначення = Період
                });

                await НалаштуванняКористувача.Save(false);
            }
        }
    }
}