
/*
        ТовариНаСкладах_ЗалишкиТаОбороти_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариНаСкладах_ЗалишкиТаОбороти_Звіт
    {
        public static async ValueTask Сформувати(DateTime ДатаПочатокПеріоду, DateTime ДатаКінецьПеріоду)
        {

            string query = $@"
SELECT
    to_char(ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Період}, 'DD.MM.YYYY') AS Період,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Склад} AS Склад,
            Довідники_Склади.{Склади_Const.Назва} AS Склад_Назва,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.ВНаявностіПрихід} AS ВНаявностіПрихід,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.ВНаявностіРозхід} AS ВНаявностіРозхід,
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.ВНаявностіЗалишок} AS ВНаявностіЗалишок
FROM
    {ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.TABLE} AS ЗалишкиТаОбороти

    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {Склади_Const.TABLE} AS Довідники_Склади ON Довідники_Склади.uid = 
        ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Склад}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Серія}

WHERE
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Період} >= @ПочатокПеріоду AND
    ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Період} <= @КінецьПеріоду

ORDER BY ЗалишкиТаОбороти.{ТовариНаСкладах_ЗалишкиТаОбороти_TablePart.Період}
";
            Dictionary<string, object> paramQuery = new Dictionary<string, object>
            {
                { "ПочатокПеріоду", ДатаПочатокПеріоду },
                { "КінецьПеріоду", ДатаКінецьПеріоду }
            };

            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариНаСкладах_ЗалишкиТаОбороти_Звіт",
                Caption = "Залишки та обороти",
                Query = query,
                ParamQuery = paramQuery,
                GetInfo = () =>
                {
                    string text = $"З {ДатаПочатокПеріоду.ToString("dd.MM.yyyy")} по {ДатаКінецьПеріоду.ToString("dd.MM.yyyy")}";
                    return ValueTask.FromResult(text);
                }
            };

            Звіт.ColumnSettings.Add("Період", new("Період"));
            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("ХарактеристикаНоменклатури", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Склад_Назва", new("Склад", "Склад", Склади_Const.POINTER));
            Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявностіПрихід", new("Прихід", "", "", 1));
            Звіт.ColumnSettings.Add("ВНаявностіРозхід", new("Розхід", "", "", 1));
            Звіт.ColumnSettings.Add("ВНаявностіЗалишок", new("Залишок", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}

