
/*
        ТовариНаСкладах_Підсумки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариНаСкладах_Підсумки_Звіт
    {
        public static async ValueTask Сформувати()
        {
            string query = $@"
SELECT
    Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Підсумки.{ТовариНаСкладах_Підсумки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Склад} AS Склад,
            Довідники_Склади.{Склади_Const.Назва} AS Склад_Назва,
    Підсумки.{ТовариНаСкладах_Підсумки_TablePart.ВНаявності} AS ВНаявності
FROM
    {ТовариНаСкладах_Підсумки_TablePart.TABLE} AS Підсумки
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Підсумки.{ТовариНаСкладах_Підсумки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Серія}
    
    LEFT JOIN {Склади_Const.TABLE} AS Довідники_Склади ON Довідники_Склади.uid = 
        Підсумки.{ТовариНаСкладах_Підсумки_TablePart.Склад}
    
";
            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариНаСкладах_Підсумки_Звіт",
                Caption = "Підсумки",
                Query = query
            };

            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Склад_Назва", new("Склад", "Склад", Склади_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявності", new("В наявності", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}

