
/*
        ТовариНаСкладах_Залишки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариНаСкладах_Залишки_Звіт
    {
        public static async ValueTask Сформувати(DateTime ДатаПочатокПеріоду, DateTime ДатаКінецьПеріоду)
        {

            string query = $@"
SELECT
    to_char(Залишки.{ТовариНаСкладах_Залишки_TablePart.Період}, 'DD.MM.YYYY') AS Період,
    Залишки.{ТовариНаСкладах_Залишки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Залишки.{ТовариНаСкладах_Залишки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Залишки.{ТовариНаСкладах_Залишки_TablePart.Склад} AS Склад,
            Довідники_Склади.{Склади_Const.Назва} AS Склад_Назва,
    Залишки.{ТовариНаСкладах_Залишки_TablePart.Серія} AS Серія,
            concat_ws (', ', Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер}, Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.ДатаСтворення}) AS Серія_Назва,
    Залишки.{ТовариНаСкладах_Залишки_TablePart.ВНаявності} AS ВНаявності
FROM
    {ТовариНаСкладах_Залишки_TablePart.TABLE} AS Залишки
    
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Залишки.{ТовариНаСкладах_Залишки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Залишки.{ТовариНаСкладах_Залишки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {Склади_Const.TABLE} AS Довідники_Склади ON Довідники_Склади.uid = 
        Залишки.{ТовариНаСкладах_Залишки_TablePart.Склад}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        Залишки.{ТовариНаСкладах_Залишки_TablePart.Серія}

WHERE
    Залишки.{ТовариНаСкладах_Залишки_TablePart.Період} >= @ПочатокПеріоду AND
    Залишки.{ТовариНаСкладах_Залишки_TablePart.Період} <= @КінецьПеріоду

ORDER BY Залишки.{ТовариНаСкладах_Залишки_TablePart.Період}
";
            Dictionary<string, object> paramQuery = new Dictionary<string, object>
            {
                { "ПочатокПеріоду", ДатаПочатокПеріоду },
                { "КінецьПеріоду", ДатаКінецьПеріоду }
            };

            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариНаСкладах_Залишки_Звіт",
                Caption = "Залишки",
                Query = query,
                ParamQuery = paramQuery,
                GetInfo = () =>
                {
                    string text = $"З {ДатаПочатокПеріоду.ToString("dd.MM.yyyy")} по {ДатаКінецьПеріоду.ToString("dd.MM.yyyy")}";
                    return ValueTask.FromResult(text);
                }
            };

            Звіт.ColumnSettings.Add("Період", new("Період"));
            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("ХарактеристикаНоменклатури", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Склад_Назва", new("Склад", "Склад", Склади_Const.POINTER));
            Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявності", new("В наявності", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            Звіт.View(Program.GeneralNotebook);
        }
    }
}

