
/*
        ТовариВКомірках_ЗалишкиТаОбороти_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Константи;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариВКомірках_ЗалишкиТаОбороти_Звіт
    {
        public static async ValueTask Сформувати(DateTime ДатаПочатокПеріоду, DateTime ДатаКінецьПеріоду)
        {

            string query = $@"
SELECT
    to_char(ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Період}, 'DD.MM.YYYY') AS Період,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Пакування} AS Пакування,
            Довідники_ПакуванняОдиниціВиміру.{ПакуванняОдиниціВиміру_Const.Назва} AS Пакування_Назва,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Комірка} AS Комірка,
            Довідники_СкладськіКомірки.{СкладськіКомірки_Const.Назва} AS Комірка_Назва,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.ВНаявностіПрихід} AS ВНаявностіПрихід,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.ВНаявностіРозхід} AS ВНаявностіРозхід,
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.ВНаявностіЗалишок} AS ВНаявностіЗалишок
FROM
    {ТовариВКомірках_ЗалишкиТаОбороти_TablePart.TABLE} AS ЗалишкиТаОбороти
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {ПакуванняОдиниціВиміру_Const.TABLE} AS Довідники_ПакуванняОдиниціВиміру ON Довідники_ПакуванняОдиниціВиміру.uid = 
        ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Пакування}
    
    LEFT JOIN {СкладськіКомірки_Const.TABLE} AS Довідники_СкладськіКомірки ON Довідники_СкладськіКомірки.uid = 
        ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Комірка}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Серія}

WHERE
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Період} >= @ПочатокПеріоду AND
    ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Період} <= @КінецьПеріоду

ORDER BY ЗалишкиТаОбороти.{ТовариВКомірках_ЗалишкиТаОбороти_TablePart.Період}
";
            Dictionary<string, object> paramQuery = new Dictionary<string, object>
            {
                { "ПочатокПеріоду", ДатаПочатокПеріоду },
                { "КінецьПеріоду", ДатаКінецьПеріоду }
            };

            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариВКомірках_ЗалишкиТаОбороти_Звіт",
                Caption = "ЗалишкиТаОбороти",
                Query = query,
                ParamQuery = paramQuery,
                GetInfo = () =>
                {
                    string text = $"З {ДатаПочатокПеріоду.ToString("dd.MM.yyyy")} по {ДатаКінецьПеріоду.ToString("dd.MM.yyyy")}";
                    return ValueTask.FromResult(text);
                }
            };

            Звіт.ColumnSettings.Add("Період", new("Період"));
            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Пакування_Назва", new("Пакування", "Пакування", ПакуванняОдиниціВиміру_Const.POINTER));
            Звіт.ColumnSettings.Add("Комірка_Назва", new("Комірка", "Комірка", СкладськіКомірки_Const.POINTER));
            Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявностіПрихід", new("Прихід", "", "", 1));
            Звіт.ColumnSettings.Add("ВНаявностіРозхід", new("Розхід", "", "", 1));
            Звіт.ColumnSettings.Add("ВНаявностіЗалишок", new("В наявності", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            Звіт.View(Program.GeneralNotebook);
        }
    }
}
