
/*
        ТовариВКомірках_Залишки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using GeneratedCode.Константи;
using GeneratedCode.Довідники;
using GeneratedCode.Документи;
using GeneratedCode.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариВКомірках_Залишки_Звіт
    {
        public static async ValueTask Сформувати(DateTime ДатаПочатокПеріоду, DateTime ДатаКінецьПеріоду)
        {

            string query = $@"
SELECT
    to_char(Залишки.{ТовариВКомірках_Залишки_TablePart.Період}, 'DD.MM.YYYY') AS Період,
    Залишки.{ТовариВКомірках_Залишки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Залишки.{ТовариВКомірках_Залишки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Залишки.{ТовариВКомірках_Залишки_TablePart.Пакування} AS Пакування,
            Довідники_ПакуванняОдиниціВиміру.{ПакуванняОдиниціВиміру_Const.Назва} AS Пакування_Назва,
    Залишки.{ТовариВКомірках_Залишки_TablePart.Комірка} AS Комірка,
            Довідники_СкладськіКомірки.{СкладськіКомірки_Const.Назва} AS Комірка_Назва,
    Залишки.{ТовариВКомірках_Залишки_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    Залишки.{ТовариВКомірках_Залишки_TablePart.ВНаявності} AS ВНаявності
FROM
    {ТовариВКомірках_Залишки_TablePart.TABLE} AS Залишки
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Залишки.{ТовариВКомірках_Залишки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Залишки.{ТовариВКомірках_Залишки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {ПакуванняОдиниціВиміру_Const.TABLE} AS Довідники_ПакуванняОдиниціВиміру ON Довідники_ПакуванняОдиниціВиміру.uid = 
        Залишки.{ТовариВКомірках_Залишки_TablePart.Пакування}
    
    LEFT JOIN {СкладськіКомірки_Const.TABLE} AS Довідники_СкладськіКомірки ON Довідники_СкладськіКомірки.uid = 
        Залишки.{ТовариВКомірках_Залишки_TablePart.Комірка}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        Залишки.{ТовариВКомірках_Залишки_TablePart.Серія}

WHERE
    Залишки.{ТовариВКомірках_Залишки_TablePart.Період} >= @ПочатокПеріоду AND
    Залишки.{ТовариВКомірках_Залишки_TablePart.Період} <= @КінецьПеріоду

ORDER BY Залишки.{ТовариВКомірках_Залишки_TablePart.Період}
";
            Dictionary<string, object> paramQuery = new()
            {
                { "ПочатокПеріоду", ДатаПочатокПеріоду },
                { "КінецьПеріоду", ДатаКінецьПеріоду }
            };

            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариВКомірках_Залишки_Звіт",
                Caption = "Залишки",
                Query = query,
                ParamQuery = paramQuery,
                GetInfo = () =>
                {
                    string text = $"З {ДатаПочатокПеріоду.ToString("dd.MM.yyyy")} по {ДатаКінецьПеріоду.ToString("dd.MM.yyyy")}";
                    return ValueTask.FromResult(text);
                }
            };

            Звіт.ColumnSettings.Add("Період", new("Період"));
            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));

            if (Системні.ВестиОблікПоХарактеристикахНоменклатури_Const)
                Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));

            Звіт.ColumnSettings.Add("Пакування_Назва", new("Пакування", "Пакування", ПакуванняОдиниціВиміру_Const.POINTER));
            Звіт.ColumnSettings.Add("Комірка_Назва", new("Комірка", "Комірка", СкладськіКомірки_Const.POINTER));

            if (Системні.ВестиОблікПоСеріяхНоменклатури_Const)
                Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));

            Звіт.ColumnSettings.Add("ВНаявності", new("В наявності", "", "", 1, ЗвітСторінка.ФункціяДляКолонкиБазоваДляЧисла));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}
