
/*
        ТовариВКомірках_Підсумки_Звіт.cs
        Звіт
*/

using Gtk;
using InterfaceGtk;
using AccountingSoftware;
using StorageAndTrade_1_0.Константи;
using StorageAndTrade_1_0.Довідники;
using StorageAndTrade_1_0.Документи;
using StorageAndTrade_1_0.РегістриНакопичення;

namespace StorageAndTrade
{
    public static class ТовариВКомірках_Підсумки_Звіт
    {
        public static async ValueTask Сформувати()
        {

            string query = $@"
SELECT
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.Номенклатура} AS Номенклатура,
            Довідники_Номенклатура.{Номенклатура_Const.Назва} AS Номенклатура_Назва,
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.ХарактеристикаНоменклатури} AS ХарактеристикаНоменклатури,
            Довідники_ХарактеристикиНоменклатури.{ХарактеристикиНоменклатури_Const.Назва} AS ХарактеристикаНоменклатури_Назва,
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.Пакування} AS Пакування,
            Довідники_ПакуванняОдиниціВиміру.{ПакуванняОдиниціВиміру_Const.Назва} AS Пакування_Назва,
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.Комірка} AS Комірка,
            Довідники_СкладськіКомірки.{СкладськіКомірки_Const.Назва} AS Комірка_Назва,
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.Серія} AS Серія,
            Довідники_СеріїНоменклатури.{СеріїНоменклатури_Const.Номер} AS Серія_Назва,
    Підсумки.{ТовариВКомірках_Підсумки_TablePart.ВНаявності} AS ВНаявності
FROM
    {ТовариВКомірках_Підсумки_TablePart.TABLE} AS Підсумки
    LEFT JOIN {Номенклатура_Const.TABLE} AS Довідники_Номенклатура ON Довідники_Номенклатура.uid = 
        Підсумки.{ТовариВКомірках_Підсумки_TablePart.Номенклатура}
    
    LEFT JOIN {ХарактеристикиНоменклатури_Const.TABLE} AS Довідники_ХарактеристикиНоменклатури ON Довідники_ХарактеристикиНоменклатури.uid = 
        Підсумки.{ТовариВКомірках_Підсумки_TablePart.ХарактеристикаНоменклатури}
    
    LEFT JOIN {ПакуванняОдиниціВиміру_Const.TABLE} AS Довідники_ПакуванняОдиниціВиміру ON Довідники_ПакуванняОдиниціВиміру.uid = 
        Підсумки.{ТовариВКомірках_Підсумки_TablePart.Пакування}
    
    LEFT JOIN {СкладськіКомірки_Const.TABLE} AS Довідники_СкладськіКомірки ON Довідники_СкладськіКомірки.uid = 
        Підсумки.{ТовариВКомірках_Підсумки_TablePart.Комірка}
    
    LEFT JOIN {СеріїНоменклатури_Const.TABLE} AS Довідники_СеріїНоменклатури ON Довідники_СеріїНоменклатури.uid = 
        Підсумки.{ТовариВКомірках_Підсумки_TablePart.Серія}
    
";
            ЗвітСторінка Звіт = new ЗвітСторінка()
            {
                ReportName = "ТовариВКомірках_Підсумки_Звіт",
                Caption = "Підсумки",
                Query = query
            };

            Звіт.ColumnSettings.Add("Номенклатура_Назва", new("Номенклатура", "Номенклатура", Номенклатура_Const.POINTER));
            Звіт.ColumnSettings.Add("ХарактеристикаНоменклатури_Назва", new("Характеристика", "ХарактеристикаНоменклатури", ХарактеристикиНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("Пакування_Назва", new("Пакування", "Пакування", ПакуванняОдиниціВиміру_Const.POINTER));
            Звіт.ColumnSettings.Add("Комірка_Назва", new("Комірка", "Комірка", СкладськіКомірки_Const.POINTER));
            Звіт.ColumnSettings.Add("Серія_Назва", new("Серія", "Серія", СеріїНоменклатури_Const.POINTER));
            Звіт.ColumnSettings.Add("ВНаявності", new("В наявності", "", "", 1));

            await Звіт.Select();

            Звіт.FillTreeView();
            await Звіт.View(Program.GeneralNotebook);
        }
    }
}
